[//"Triggers a [事件名] event"
    {
        "name":"World Purification War",
        "text":"Communication established. Surprisingly, there are survivors on the surface. Please protect the World Purification Core—we only have one chance. The fate of the world is in our hands.(Keep parasites away from our cities)",
        "choices":[
        {
        "text":"Fight to the last minute!",
        "uniques":[
        "[1] free [World Purification Core] units appear",
        "Gain [1000] [Gold]",
"Triggers a [PlotWar] event",
		    ],
        },
        ]
    },
    {
        "name":"Plot1",
        "text":"I do not know when, a strange creature appeared in the world, no one knows where they came from, they seem to suddenly appear.",
        "choices":[
        {
        "text":"",
        "uniques":[
		    ],
        },
        ]
    },
    {
        "name":"Plot2",
        "text":"The strange lives seemed to have changed and began to show aggression, leaving a mark of their own on the land they passed.",
        "choices":[
        {
        "text":"",
        "uniques":[
		    ],
        },
        ]
    },
    {
        "name":"Plot3",
        "text":"The life we call parasites is evolving, a tree-like individual is discovered, A large area centered on that particular individual is transformed into an erosion site, with a large number of parasite individuals active around it.",
        "choices":[
        {
        "text":"",
        "uniques":[
		    ],
        },
        ]
    },
    {
        "name":"Plot4",
        "text":"We found an unknown massive individual in the wild, which is completely different from the type we found earlier, and it seems to be managing the eroded area, There are many ground-based parasite individuals guarding the edge of the eroded area.",
        "choices":[
        {
        "text":"",
        "uniques":[
		    ],
        },
        ]
    },
    {
        "name":"Plot5",
        "text":"The morphology of those parasites has changed dramatically, and they are beginning to attack us in a major way. We found some information from some of the remains occupied by the parasites at some point. Although only a few pieces, perhaps we can collect a certain number to be able to find something.",
        "choices":[
        {
        "text":"",
        "uniques":[
		    ],
        },
        ]
    },
    {
        "name":"Plot6",
        "text":"Our war with parasites continues, and the latest discovery is that they are adapting to our attacks, The technical information we collected was studied and the method of building the communication tower was obtained. We were able to contact survivors in other areas and the lost 101 base.",
        "choices":[
        {
        "text":"",
        "uniques":[
		    ],
        },
        ]
    },
    {
        "name":"Plot7",
        "text":"Parasites have undergone another mass evolution, and we don't know if their evolution will end. If so, what would it be? Our communication with Base 101 was brief, like it was blocked by something. From the hinterland of the parasites came a terrible wave of energy. That should be the communication of the ancestor parasite, and we need to kill it and take the core as a key preparation for the cleansing of the world.",
        "choices":[
        {
        "text":"",
        "uniques":[
		    ],
        },
        ]
    },
    {
        "name":"Plot10",
        "text":"The parasite begins to assimilate everything, his tentacles go deep into the core, and his branches cover the sky. The fate of humanity has been like a candle in the wind, our world has come to the last moment. All take up arms and fight the parasites to the end!",
        "choices":[
        {
        "text":"",
        "uniques":[
		    ],
        },
        ]
    },
    {
        "name":"PlotWar",
        "text":"The dazzling light rises from the city center, piercing the sky, the holy light sprinkled on the flesh-covered earth. For the first time the parasites show fear, and this time we can actually kill them and drive them out of our world. Our communications with Base 101 are connected again, providing us with a view around the world's cleansing core. The survival of humanity and the fate of the world all depend on the victory or defeat of this war. This battle can only be won!",
        "choices":[
        {
        "text":"",
        "uniques":[
		    ],
        },
        ]
    },
    {
        "name":"PlotEnd",
        "text":"We... we won? The orbital matrix drops thunderstorms, wiping out the parasite's main force. World Purification Core successfully released. The flesh of the parasite-infested soil has become inactive, and all the evidence points to one word - victory. Humans have survived a catastrophe called a parasite, and those who survived are celebrating the joy of surviving. Although the parasites have been eliminated, their traces remain, and we need to recover.",
        "choices":[
        {
        "text":"",
        "uniques":[
        "Comment [Well done, you have successfully made it through layers of darkness and countless hardships. Thank you for experiencing the world of the Escaping Parasites. You can tell me in QQ group 926974044 or on my Discord post, and you will receive a reward of commemorative units.]",
        
		    ],
        },
        ]
    },
    
    
    
    
    {
        "name":"Parasitic1",
        "text":"Heaven",
        "choices":[
        {"text":"",
        "uniques":[],},]},
    {
        "name":"Parasitic2",
        "text":"Parasitic immortality",
        "choices":[
        {"text":"",
        "uniques":[],},]},
    {
        "name":"Parasitic3",
        "text":"So red, so sweet, blood",
        "choices":[
        {"text":"",
        "uniques":[],},]},
    {
        "name":"Parasitic4",
        "text":"It's food",
        "choices":[
        {"text":"",
        "uniques":[],},]},
    {
        "name":"Parasitic5",
        "text":"Run!",
        "choices":[
        {"text":"",
        "uniques":[],},]},
    {
        "name":"Parasitic6",
        "text":"Here... teach me... free me",
        "choices":[
        {"text":"",
        "uniques":[],},]},
    {
        "name":"Parasitic7",
        "text":"Body, good pain, eat you",
        "choices":[
        {"text":"",
        "uniques":[],},]},
    {
        "name":"Parasitic8",
        "text":"Destroy, devour, evolve",
        "choices":[
        {"text":"",
        "uniques":[],},]},
    {
        "name":"Parasitic9",
        "text":"A lot of voices... who... who's talking",
        "choices":[
        {"text":"",
        "uniques":[],},]},
    {
        "name":"Parasitic10",
        "text":"Stupid, arrogant, just human",
        "choices":[
        {"text":"",
        "uniques":[],},]},
    {
        "name":"Parasitic11",
        "text":"I will not back down!",
        "choices":[
        {"text":"",
        "uniques":[],},]},
        
        
        
        
        
    {
        "name":"Parasitic12",
        "text":"Purebred anger, excellence for the road!",
        "choices":[
        {"text":"",
        "uniques":[],},]},
    {
        "name":"Parasitic13",
        "text":"The first ancestor comes, the blood spatters thousands of miles!",
        "choices":[
        {"text":"",
        "uniques":[],},]},
    {
        "name":"Parasitic14",
        "text":"The seed of adaptation, recast glory!",
        "choices":[
        {"text":"",
        "uniques":[],},]},
    {
        "name":"Parasitic15",
        "text":"Assimilate the herd and put up a fight!",
        "choices":[
        {"text":"",
        "uniques":[],},]},
    
    
    

    
    
    
    
    
    
    {
        "name":"Human hero",
        "text":"The green light from the communication tower shot up into the sky, and after an unsignaled noise, our instruments finally responded. Data from Base 101 is being transmitted to us, but after transferring a few files, our communication was blocked by something, The readable content in the file is only a few coordinates and one sentence. That sentence is confused, repeat these words, ancestor species, kill, evolution.",
        "choices":[
        {
        "text":"",
        "uniques":[
        "[1] free [Younger brother Zhen] units appear",
        
		    ],
        },
        {
        "text":"",
        "uniques":[
        "[1] free [Your old buddy] units appear",
        
		    ],
        },
        /*{
        "text":"",
        "uniques":[
        "[1] free [sass] units appear",
        
		    ],
        },*/
        
        
        
        
        
        
        
        
        
        
        
        
        
        
        ]
    },
    
    
    
    
    
    
    
    
    
    
    
    
    
    
    
    
    
    
    
    
    
    
    
    
    


]
    //<hidden from users>
    //<with [20]% chance>
    //<after [40] turns>
    //<when at war>
    //<when not at war>
    //<for [28] turns>
    //<every [8] turns>
    //<when number of [Stability] is less than [Faith]>